* Turkey's 2018 general election

there is more data from the [[https://gist.github.com/oztalha/0bdaa68e53466f64055ad276f11e868e][presidential]] and [[https://gist.github.com/oztalha/63f2de239bac84f4f81e86442d1a0749][parliamentary]] elections, from
[[https://twitter.com/tozCSS/status/1011004328549597186][Oz Talha]].  like Talha's, this presents data from [[https://www.yenisafak.com/secim-2018/secim-sonuclari][YeniŞafak.]]

#+BEGIN_SRC R :session rs :var ifile="genel-secim-2018-sonuclari.csv" :results table :colnames yes :rownames yes :exports results
  x <- read.csv(ifile)
  parties <- colnames(x)[-(1:5)]
  parties <- parties[1:(length(parties)/2)]
  mps <- colnames(x)[-(1:5)]
  mps <- mps[-(1:length(parties))]
  res <- data.frame()
  total.votes <- sum(x[,parties])
  total.mps <- sum(x[,mps])
  res <- data.frame()
  for (party in parties) {
      votes <- sum(x[,party])
      mps <- sum(x[,paste(party, "MPs", sep=".")])
      df <- data.frame(votes=votes, pctvotes=votes/total.votes,
                       mps=mps, pctmps=mps/total.mps)
      rownames(df) <- party
      res <- rbind(res, df)
  }
  res <- res[order(rownames(res)),]
  res[,"pctvotes"] <- as.integer(res[,"pctvotes"]*10000)/100
  res[,"pctmps"] <- as.integer(res[,"pctmps"]*10000)/100
  res
#+END_SRC

#+RESULTS:
|           |    votes | pctvotes | mps | pctmps |
|-----------+----------+----------+-----+--------|
| AK.Parti  | 21335581 |    42.56 | 295 |  49.16 |
| Bağımsız  |    75633 |     0.15 |   0 |      0 |
| CHP       | 11348878 |    22.63 | 146 |  24.33 |
| Diğer     |        4 |        0 |   0 |      0 |
| HDP       |  5865977 |     11.7 |  67 |  11.16 |
| HÜDA.PAR  |   157612 |     0.31 |   0 |      0 |
| İYİ.Parti |  4990710 |     9.95 |  43 |   7.16 |
| MHP       |  5564514 |     11.1 |  49 |   8.16 |
| SP        |   673731 |     1.34 |   0 |      0 |
| VP        |   117779 |     0.23 |   0 |      0 |

